Tekla Open API Reference for Tekla Structures 2025
ContainerElement.Frame Property
 The frame of the container element.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Frame Frame { get; set; }
Public Property Frame As Frame
	Get
	Set
Property Value
Type: Frame
See Also
Reference
ContainerElement Class
Tekla.Structures.Drawing Namespace